#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<stdlib.h>
#include<ctype.h>
#include<math.h>
int main()
{
	int a1, b1, c1, a2, b2, c2, c,d, e,f,d1, m1/*, y1, leap, hh1, mm1, ss1, hh2, mm2, ss2, max_i*/;
	float a, b, per;
	/*double alpha, r_min_opis, r_max_vpis;*/
	//char izm;
	//const float duym = 2.54f;
	system("chcp 1251 > nul");
	//1.	Ввести длину отрезка с указанием шкалы измерения (c – сантиметры, i – дюймы), напечатать результат в обеих шкалах: например, 
//a.	при вводе «2i» напечатать «2”= 5.08 cm»
//b.	при вводе «5.08c» напечатать «5.08  cm = 2”»

	
/*	printf("Введи длину отрезка с указанием шкалы измерения: \n");
	scanf("%g%c", &a, &izm) ==2
		&& izm =='i' && (b = a/duym) 
		&& printf("Пересчёт данных:\n%.02f\" = %.02fcm\n", 
		a,
		b
		)
		|| izm == 'c' && (b = a*duym)
		&& printf("Пересчёт данных:\n%.02fcm = %.02f\"\n", 
		a,
		b
		)
		|| printf("Invalid format!\n");
	
	//2.	Ввести температуру с указанием шкалы измерения (C – шкала Цельсия, F– шкала Фаренгейта), напечатать результат в обеих шкалах (формула для пересчета c=(5/9)(f-32)): например,
//a.	при вводе «32F» или «32f» напечатать «32F= 0C»
//b.	при вводе «5C» или «5c» напечатать «5C= 41F»
	printf("Enter temperature: \n");
	scanf("%g%c", &a, &izm) == 2
		&& toupper(izm) =='F' && (b = (a-32)*5/9) 
		&& printf("New t:\n%.02f\xF8 F = %.02f\xF8 C\n", 
		a,
		b
		)
		|| toupper(izm) == 'C' && (b = a*9/5 +32)
		&& printf("New t:\n%.02f\xF8 C = %.02f\xF8 F\n", 
		a,
		b
		)
		|| printf("Invalid format!\n");

	//4.	Ввести три числа, напечатать максимальное из них
	printf("Введи 3 целых числа\n");
	scanf("%d %d %d", &c,&d,&e);
	max_i = c>d ? c : d;
	max_i = max_i>e ? max_i : e;
	printf("Максимальное число: %d\n",
		max_i);

	//5.	Ввести два числа, напечатать, являются ли они взаимно простыми, или какое из них делится на другое
	printf("Введи 2 целых числа\n");
	scanf("%d %d", &c,&d);
	(c>d ? c%d : d%c) && printf("Числа непростые\n")
		|| printf("Числа простые\n");
	
	//6.	Образуют ли цифры четырехзначного числа арифметическую прогрессию?
	printf("Введи четырехзначное число\n");
	scanf("%1d%1d%1d%1d", &c,&d,&e,&f);
	(f-e) == (e-d) && (e-d) == (d-c)
		&& printf("Это число - арифметическая прогрессия\n")
		|| printf("Это не прогрессия\n");

	//7. «Идеальный» вес человека на 100 меньше, чем его рост в сантиметрах. Ввести рост и вес и напечатать рекомендацию по коррекции веса
	printf("Введи рост и вес\n");
	scanf("%d %d", &c,&d);
	(c-100) > d ? printf("Тебе, жирная корова, надо похудеть на %d кг\n", c-100-d)
		: (c-100)<d ? printf("Тебе, анорексичка, надо поправится на %d кг\n", d-(c-100))
		: printf("Ты идеал!");

	//8.	Ввести номер месяца (1,…,12), напечатать время года (зима,…осень)
	printf("Введи номер месяца\n");
	scanf("%d", &c) == 1
		&& (c==1 || c ==12 || c == 2)
		&& printf("Зима\n")
		|| c>=3 && c <=5
		&& printf("Весна\n")
		|| c>=6 && c <=8
		&& printf("Лето\n")
		|| c>=9 && c <=11
		&& printf("Осень\n")
		|| printf("Invalid time format!\n");

	//9.	Ввести номер дня недели (1,…,7), напечатать, рабочий ли это день, суббота или воскресенье.
	printf("Введи номер дня недели\n");
	scanf("%d", &c) == 1
		&& c>=1 && c <=5
		&& printf("Работай, уродец!\n")
		|| c == 6 
		&& printf("Сегодня суббота, отдыхай, уродец!\n")
		|| c ==7
		&& printf("Сегодня воскресенье, отдыхай, уродец!\n")
		|| printf("Invalid time format!\n");

	//10.	Ввести два значения времени в формате чч:мм:сс, напечатать, какое из них больше
	printf("Enter time in format чч:мм:сс\n");
	scanf_s("%2d:%2d:%2d\n%2d:%2d:%2d", &hh1,&mm1,&ss1,&hh2,&mm2,&ss2) == 6
		&& hh1>=0 && hh1<24 
		&& mm1>=0 && mm1<60 
		&& ss1>=0 && ss1<60
		&& hh2>=0 && hh2<24 
		&& mm2>=0 && mm2<60 
		&& ss2>=0 && ss2<60
		&& printf("Даты введены успешно.\n%02d:%02d:%02d\n%02d:%02d:%02d\n", hh1, mm1, ss1, hh2, mm2, ss2)
		|| printf("Invalid time format!\n");
	c = hh1 << 12 | mm1 << 6 | ss1;
	d = hh2 << 12 | mm2 << 6 | ss2;
	printf("%02d:%02d:%02d %c %02d:%02d:%02d\n",
		hh1, mm1, ss1, 
		c>d ? '>' : c<d ? '<' : '=',
		hh2, mm2, ss2);

	//11.	Ввести номер года, напечатать, является ли он високосным
	//12.	Ввести дату в формате дд.мм.гггг, напечатать следующую дату
	printf("Enter time in format дд.мм.гггг\n");
	scanf_s("%2d.%2d.%4d", &d1,&m1,&y1) == 3
		&& d1>=1 && d1<=31 
		&& m1>=1 && m1<=12 
		&& y1>=1 && y1<=2016
		&& printf("Дата введена успешно.\n%02d.%02d.%04d\n", d1, m1, y1)
		|| printf("Invalid time format!\n");
	leap = y1%4 ==0 && (y1%100!=0 || y1%400 ==0);
	printf("%d is%s leap year\n", y1,leap ? "": "n't");
	d1 == 31 && (m1 == 1 || m1 == 3 || m1==5 || m1==7 || m1==8 || m1==10)
		&& (d1 = 1, m1 +=1)
	|| d1 ==30 && (m1 == 4 || m1 == 6 || m1==9 || m1==11)
		&& (d1 = 1, m1 +=1)
	|| d1==28 && m1==2 && (!leap ? (d1 = 1, m1 =3) : (d1 +=1))
	|| d1==29 && m1==2 && leap 
		&& (d1 = 1, m1 =3)
	|| d1 == 31 && m1 == 12
		&& (d1 = 1, m1=1, y1 +=1)
	|| (d1 +=1);
	printf("Новая дата введена успешно:\n%02d.%02d.%04d\n", d1, m1, y1);

	//13.	Ввести дату в формате дд.мм.гггг, напечатать номер дня года, соответствующий этой дате (1 января – 1-й день и т.д.)
	c=0;
	printf("Enter time in format дд.мм.гггг\n");
	scanf_s("%2d.%2d.%4d", &d1,&m1,&y1) == 3
		&& d1>=1 && d1<=31 
		&& m1>=1 && m1<=12 
		&& y1>=1 && y1<=2016
		&& printf("Дата введена успешно.\n%02d.%02d.%04d\n", d1, m1, y1)
		|| printf("Invalid time format!\n");
	leap = y1%4 ==0 && (y1%100!=0 || y1%400 ==0);
	leap ? 
		(m1 == 1 && (c = d1)
		||m1 == 2 && (c = d1+31) 
		||m1 == 3 && (c = d1+31+29)
		||m1 == 4 && (c = d1+31*2+29)
		||m1 == 5 && (c = d1+31*2+29+30)
		||m1 == 6 && (c = d1+31*3+29+30)
		||m1 == 7 && (c = d1+31*3+29+30*2)
		||m1 == 8 && (c = d1+31*4+29+30*2)
		||m1 == 9 && (c = d1+31*5+29+30*2)
		||m1 == 10 && (c = d1+31*5+29+30*3)
		||m1 == 11 && (c = d1+31*6+29+30*3)
		||m1 == 12 && (c = d1+31*6+29+30*4)
		)
		: 
		(m1 == 1 && (c = d1)
		||m1 == 2 && (c = d1+31) 
		||m1 == 3 && (c = d1+31+28)
		||m1 == 4 && (c = d1+31*2+28)
		||m1 == 5 && (c = d1+31*2+28+30)
		||m1 == 6 && (c = d1+31*3+28+30)
		||m1 == 7 && (c = d1+31*3+28+30*2)
		||m1 == 8 && (c = d1+31*4+28+30*2)
		||m1 == 9 && (c = d1+31*5+28+30*2)
		||m1 == 10 && (c = d1+31*5+28+30*3)
		||m1 == 11 && (c = d1+31*6+28+30*3)
		||m1 == 12 && (c = d1+31*6+28+30*4)
		);
	printf("Сейчас %d-й день сначала года\n", c);

	//14.	К введенному числу (от 0 до 99) приписать слово «копеек» в правильном падеже
	printf("Введи сумму копеек от 0 до 99\n");
	scanf("%d", &c) == 1
		&& (c==0 || c >=5 && c <=20 || c >= 25 && c <=30
		|| c >=35 && c <=40 || c >= 45 && c <=50
		|| c >=55 && c <=60 || c >= 65 && c <=70
		|| c >=55 && c <=60 || c >= 65 && c <=70
		|| c >=75 && c <=80 || c >= 85 && c <=90
		|| c >= 95 && c <=99)
		&& printf("у тебя %d копеек\n", c)
		|| (c == 1 || c==21 || c == 31 || c == 41
		||c == 51 || c==61 || c == 71 || c == 81 || c==91)
		&& printf("у тебя %d копейка\n", c)
		|| printf("у тебя %d копейки\n", c);

	

	//16.	К введенному числу (от 0 до 10…0.99) приписать слова «рублей» и «копеек» в правильном падеже
	printf("Введи сумму рублей от 0 до 1000\n");
	scanf("%d.%d", &c,&m1);
	d1 = c%100;
	(m1==0 || m1 >=5 && m1 <=20 || m1 >= 25 && m1 <=30
	|| m1 >=35 && m1 <=40 || m1 >= 45 && m1 <=50
	|| m1 >=55 && m1 <=60 || m1 >= 65 && m1 <=70
	|| m1 >=55 && m1 <=60 || m1 >= 65 && m1 <=70
	|| m1 >=75 && m1 <=80 || m1 >= 85 && m1 <=90
	|| m1 >= 95 && m1 <=99)
	&& (
	(d1==0 || d1 >=5 && d1 <=20 || d1 >= 25 && d1 <=30
	|| d1 >=35 && d1 <=40 || d1 >= 45 && d1 <=50
	|| d1 >=55 && d1 <=60 || d1 >= 65 && d1 <=70
	|| d1 >=55 && d1 <=60 || d1 >= 65 && d1 <=70
	|| d1 >=75 && d1 <=80 || d1 >= 85 && d1 <=90
	|| d1 >= 95 && d1 <=99)
	&& printf("у тебя %d рублей %d копеек\n", c, m1)
	|| (d1 == 1 || d1==21 || d1 == 31 || d1 == 41
	||d1 == 51 || d1==61 || d1 == 71 || d1 == 81 || d1==91)
	&& printf("у тебя %d рубль %d копеек\n", c, m1)
	|| printf("у тебя %d рубля %d копеек\n", c, m1)
	)
	|| (m1 == 1 || m1==21 || m1 == 31 || m1 == 41
	||m1 == 51 || m1==61 || m1 == 71 || m1 == 81 || m1==91)
	&& (
	(d1==0 || d1 >=5 && d1 <=20 || d1 >= 25 && d1 <=30
	|| d1 >=35 && d1 <=40 || d1 >= 45 && d1 <=50
	|| d1 >=55 && d1 <=60 || d1 >= 65 && d1 <=70
	|| d1 >=55 && d1 <=60 || d1 >= 65 && d1 <=70
	|| d1 >=75 && d1 <=80 || d1 >= 85 && d1 <=90
	|| d1 >= 95 && d1 <=99)
	&& printf("у тебя %d рублей %d копейка\n", c, m1)
	|| (d1 == 1 || d1==21 || d1 == 31 || d1 == 41
	||d1 == 51 || d1==61 || d1 == 71 || d1 == 81 || d1==91)
	&& printf("у тебя %d рубль %d копейка\n", c, m1)
	|| printf("у тебя %d рубля %d копейка\n", c, m1)
	)
	|| (
		(d1==0 || d1 >=5 && d1 <=20 || d1 >= 25 && d1 <=30
	|| d1 >=35 && d1 <=40 || d1 >= 45 && d1 <=50
	|| d1 >=55 && d1 <=60 || d1 >= 65 && d1 <=70
	|| d1 >=55 && d1 <=60 || d1 >= 65 && d1 <=70
	|| d1 >=75 && d1 <=80 || d1 >= 85 && d1 <=90
	|| d1 >= 95 && d1 <=99)
	&& printf("у тебя %d рублей %d копейки\n", c, m1)
	|| (d1 == 1 || d1==21 || d1 == 31 || d1 == 41
	||d1 == 51 || d1==61 || d1 == 71 || d1 == 81 || d1==91)
	&& printf("у тебя %d рубль %d копейки\n", c, m1)
	|| printf("у тебя %d рубля %d копейки\n", c, m1)
	);
	//system("pause");
	
	//15.	К введенному числу (от 0 до 1000) приписать слово «рублей» в правильном падеже
	printf("Введи сумму рублей от 0 до 1000\n");
	scanf("%d", &c);
	d1 = c%10;
	(!d1 || d1>=5 && d1 <= 9 || c%100 <=14 && c%100 >=11)
		&& printf("у тебя %d рублей\n", c)
	|| d1 == 1 && printf("у тебя %d рубль\n", c)
	|| printf("у тебя %d рубля\n", c);

	//16.	К введенному числу (от 0 до 10…0.99) приписать слова «рублей» и «копеек» в правильном падеже
	printf("Введи сумму рублей от 0 до 1000\n");
	scanf("%d.%d", &c,&m1);
	y1 = m1%10;
	d1 = c%10;
	(!y1 || y1>=5 && y1 <= 9 || c%100 <=14 && c%100 >=11)
		&& (
		(!d1 || d1>=5 && d1 <= 9 || c%100 <=14 && c%100 >=11)
				&& printf("у тебя %d рублей %d копеек\n", c, m1)
			|| d1 == 1 && printf("у тебя %d рубль %d копеек\n", c, m1)
			|| printf("у тебя %d рубля %d копеек\n", c, m1)
		)
	|| y1 == 1 && (
		(!d1 || d1>=5 && d1 <= 9 || c%100 <=14 && c%100 >=11)
				&& printf("у тебя %d рублей %d копейка\n", c, m1)
			|| d1 == 1 && printf("у тебя %d рубль %d копейка\n", c, m1)
			|| printf("у тебя %d рубля %d копейка\n", c, m1)
	)
	|| (!d1 || d1>=5 && d1 <= 9 || c%100 <=14 && c%100 >=11)
				&& printf("у тебя %d рублей %d копейки\n", c, m1)
			|| d1 == 1 && printf("у тебя %d рубль %d копейки\n", c, m1)
			|| printf("у тебя %d рубля %d копейки\n", c, m1);

	//17.	Дан круг радиуса r и квадрат со стороной h. Поместится ли круг в квадрат, или квадрат в круг, или ни один из них не вкладывается в другой.
	printf("Введи радиус круга и длину стороны квадрата\n");
	scanf("%d %d", &c, &d);
	r_min_opis = d/sqrt(2.);
	r_max_vpis = d/2;
	c >= r_min_opis
		? printf("Квадрат со стороной %d поместится в окружность радиусом %d\n", d,c)
		: c<=r_max_vpis 
			? printf("Окружность радиусом %d поместится в квадрат со стороной %d\n", c,d)
			: printf("Ничего не помещается!");	

	//18.	Три числа являются длинами трех отрезков. Могут ли эти отрезки быть сторонами треугольника и, если да, то какой это будет треугольник (остро- прямо- или тупоугольный, равнобедренный, равносторонний и т.д.).
	printf("Введи 3 числа - стороны треугольника\n");
	scanf("%d %d %d", &c,&d,&e) ==3
		&& c<d+e && c>abs(d-e)
		&& d<c+e && d>abs(c-e)
		&& e<c+d && e>abs(c-d)
		&& printf("Это треугольник\n")
	|| printf("Invalid data format!\n");
	c>=d && c >= e && (alpha = acos((pow((double)c,2) - pow((double)d,2) - pow((double)e,2))/(-2*d*e)))
		|| d>=c && d>=e
			&& (alpha = acos((pow((double)d,2) - pow((double)c,2) - pow((double)e,2))/(-2*c*e)))
		|| e>=c && e >=d
			&& (alpha = acos((pow((double)e,2) - pow((double)c,2) - pow((double)d,2))/(-2*d*c)));	
	f = (int)(alpha*180/3.14);
	f > 90 
		? printf("треугольник тупоугольный\n")
		: f<90 
			? printf("треугольник остроугольный\n")
			: printf("треугольник прямоугольный\n");
	(c == d || c == e || d ==e) && printf("треугольник равнобедренный\n");
	c == d && c == e && d ==e && printf("треугольник равносторонний\n");
	system("pause");
*/
	//19.	Вводится 2 тройки чисел. Первая – стороны одного треугольника, вторая – стороны другого. Действительно ли это будут треугольники и являются ли они подобными.
	printf("Введи стороны двух треугольников\n");
	scanf("%d %d %d %d %d %d", &a1,&b1,&c1,&a2,&b2,&c2) == 6
		&& a1<b1+c1 && a1>abs(b1-c1)
		&& b1<a1+c1 && b1>abs(a1-c1)
		&& c1<a1+b1 && c1>abs(a1-b1)
		&& a2<b2+c2 && a2>abs(b2-c2)
		&& b2<a2+c2 && b2>abs(a2-c2)
		&& c2<a2+b2 && c2>abs(a2-b2)
		&& printf("Это треугольники\n")
	|| printf("Invalid data format!\n");
	a1>=b1 && a1 >= c1 && (c = a1)
		|| b1 >= a1 && b1 >= c1 && (c = b1)
		|| (c = c1);
	a2>=b2 && a2 >= c2 && (d = a2)
		|| b2 >= a2 && b2 >= c2 && (d = b2)
		|| (d = c2);
	
	a1<=b1 && a1 <= c1 && (e = a1)
		|| b1 <= a1 && b1 <= c1 && (e = b1)
		|| (e = c1);
	a2<=b2 && a2 <= c2 && (f = a2)
		|| b2 <= a2 && b2 <= c2 && (f = b2)
		|| (f = c2);
	c > d ? (a = (float)c/(float)d) : (a = (float)d/(float)c);
	e > f ? (b = (float)e/(float)f) : (b = (float)f/(float)e);
	d1 = a1+b1+c1;
	m1 = a2+b2+c2;
	d1>m1 ? (per = (float)d1/(float)m1) : (per = (float)m1/(float)d1);
	//printf("%G %G\n", a,b);
	(a == b && a == per) ? printf("Треугольники подобны\n") : printf("Треугольники неподобны\n");

}